MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13254/mcu.h
// Register: PWM2CLK
#define PWM2CLK PWM2CLK
extern volatile unsigned char           PWM2CLK             __at(0x58D);
#ifndef _LIB_BUILD
asm("PWM2CLK equ 058Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} PWM2CLKbits_t;
extern volatile PWM2CLKbits_t PWM2CLKbits __at(0x58D);
// bitfield macros
#define _PWM2CLK_CLK_POSN                                   0x0
#define _PWM2CLK_CLK_POSITION                               0x0
#define _PWM2CLK_CLK_SIZE                                   0x8
#define _PWM2CLK_CLK_LENGTH                                 0x8
#define _PWM2CLK_CLK_MASK                                   0xFF
#define _PWM2CLK_CLK0_POSN                                  0x0
#define _PWM2CLK_CLK0_POSITION                              0x0
#define _PWM2CLK_CLK0_SIZE                                  0x1
#define _PWM2CLK_CLK0_LENGTH                                0x1
#define _PWM2CLK_CLK0_MASK                                  0x1
#define _PWM2CLK_CLK1_POSN                                  0x1
#define _PWM2CLK_CLK1_POSITION                              0x1
#define _PWM2CLK_CLK1_SIZE                                  0x1
#define _PWM2CLK_CLK1_LENGTH                                0x1
#define _PWM2CLK_CLK1_MASK                                  0x2
#define _PWM2CLK_CLK2_POSN                                  0x2
#define _PWM2CLK_CLK2_POSITION                              0x2
#define _PWM2CLK_CLK2_SIZE                                  0x1
#define _PWM2CLK_CLK2_LENGTH                                0x1
#define _PWM2CLK_CLK2_MASK                                  0x4
#define _PWM2CLK_CLK3_POSN                                  0x3
#define _PWM2CLK_CLK3_POSITION                              0x3
#define _PWM2CLK_CLK3_SIZE                                  0x1
#define _PWM2CLK_CLK3_LENGTH                                0x1
#define _PWM2CLK_CLK3_MASK                                  0x8

// Register: PWM2LDS
#define PWM2LDS PWM2LDS
extern volatile unsigned char           PWM2LDS             __at(0x58E);
#ifndef _LIB_BUILD
asm("PWM2LDS equ 058Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
    };
} PWM2LDSbits_t;
extern volatile PWM2LDSbits_t PWM2LDSbits __at(0x58E);
// bitfield macros
#define _PWM2LDS_LDS_POSN                                   0x0
#define _PWM2LDS_LDS_POSITION                               0x0
#define _PWM2LDS_LDS_SIZE                                   0x8
#define _PWM2LDS_LDS_LENGTH                                 0x8
#define _PWM2LDS_LDS_MASK                                   0xFF
#define _PWM2LDS_LDS0_POSN                                  0x0
#define _PWM2LDS_LDS0_POSITION                              0x0
#define _PWM2LDS_LDS0_SIZE                                  0x1
#define _PWM2LDS_LDS0_LENGTH                                0x1
#define _PWM2LDS_LDS0_MASK                                  0x1
#define _PWM2LDS_LDS1_POSN                                  0x1
#define _PWM2LDS_LDS1_POSITION                              0x1
#define _PWM2LDS_LDS1_SIZE                                  0x1
#define _PWM2LDS_LDS1_LENGTH                                0x1
#define _PWM2LDS_LDS1_MASK                                  0x2
#define _PWM2LDS_LDS2_POSN                                  0x2
#define _PWM2LDS_LDS2_POSITION                              0x2
#define _PWM2LDS_LDS2_SIZE                                  0x1
#define _PWM2LDS_LDS2_LENGTH                                0x1
#define _PWM2LDS_LDS2_MASK                                  0x4

// Register: PWM2PR
#define PWM2PR PWM2PR
extern volatile unsigned short          PWM2PR              __at(0x58F);
#ifndef _LIB_BUILD
asm("PWM2PR equ 058Fh");
#endif

// Register: PWM2PRL
#define PWM2PRL PWM2PRL
extern volatile unsigned char           PWM2PRL             __at(0x58F);
#ifndef _LIB_BUILD
asm("PWM2PRL equ 058Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
} PWM2PRLbits_t;
extern volatile PWM2PRLbits_t PWM2PRLbits __at(0x58F);
// bitfield macros
#define _PWM2PRL_PRL_POSN                                   0x0
#define _PWM2PRL_PRL_POSITION                               0x0
#define _PWM2PRL_PRL_SIZE                                   0x8
#define _PWM2PRL_PRL_LENGTH                                 0x8
#define _PWM2PRL_PRL_MASK                                   0xFF

// Register: PWM2PRH
#define PWM2PRH PWM2PRH
extern volatile unsigned char           PWM2PRH             __at(0x590);
#ifndef _LIB_BUILD
asm("PWM2PRH equ 0590h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
} PWM2PRHbits_t;
extern volatile PWM2PRHbits_t PWM2PRHbits __at(0x590);
// bitfield macros
#define _PWM2PRH_PRH_POSN                                   0x0
#define _PWM2PRH_PRH_POSITION                               0x0
#define _PWM2PRH_PRH_SIZE                                   0x8
#define _PWM2PRH_PRH_LENGTH                                 0x8
#define _PWM2PRH_PRH_MASK                                   0xFF

// Register: PWM2CPRE
#define PWM2CPRE PWM2CPRE
extern volatile unsigned char           PWM2CPRE            __at(0x591);
#ifndef _LIB_BUILD
asm("PWM2CPRE equ 0591h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRE                   :8;
    };
} PWM2CPREbits_t;
extern volatile PWM2CPREbits_t PWM2CPREbits __at(0x591);
// bitfield macros
#define _PWM2CPRE_CPRE_POSN                                 0x0
#define _PWM2CPRE_CPRE_POSITION                             0x0
#define _PWM2CPRE_CPRE_SIZE                                 0x8
#define _PWM2CPRE_CPRE_LENGTH                               0x8
#define _PWM2CPRE_CPRE_MASK                                 0xFF

// Register: PWM2PIPOS
#define PWM2PIPOS PWM2PIPOS
extern volatile unsigned char           PWM2PIPOS           __at(0x592);
#ifndef _LIB_BUILD
asm("PWM2PIPOS equ 0592h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIPOS                  :8;
    };
} PWM2PIPOSbits_t;
extern volatile PWM2PIPOSbits_t PWM2PIPOSbits __at(0x592);
// bitfield macros
#define _PWM2PIPOS_PIPOS_POSN                               0x0
#define _PWM2PIPOS_PIPOS_POSITION                           0x0
#define _PWM2PIPOS_PIPOS_SIZE                               0x8
#define _PWM2PIPOS_PIPOS_LENGTH                             0x8
#define _PWM2PIPOS_PIPOS_MASK                               0xFF

// Register: PWM2GIR
#define PWM2GIR PWM2GIR
extern volatile unsigned char           PWM2GIR             __at(0x593);
#ifndef _LIB_BUILD
asm("PWM2GIR equ 0593h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IF                 :1;
        unsigned S1P2IF                 :1;
    };
} PWM2GIRbits_t;
extern volatile PWM2GIRbits_t PWM2GIRbits __at(0x593);
// bitfield macros
#define _PWM2GIR_S1P1_POSN                                  0x0
#define _PWM2GIR_S1P1_POSITION                              0x0
#define _PWM2GIR_S1P1_SIZE                                  0x1
#define _PWM2GIR_S1P1_LENGTH                                0x1
#define _PWM2GIR_S1P1_MASK                                  0x1
#define _PWM2GIR_S1P2_POSN                                  0x1
#define _PWM2GIR_S1P2_POSITION                              0x1
#define _PWM2GIR_S1P2_SIZE                                  0x1
#define _PWM2GIR_S1P2_LENGTH                                0x1
#define _PWM2GIR_S1P2_MASK                                  0x2
#define _PWM2GIR_S1P1IF_POSN                                0x0
#define _PWM2GIR_S1P1IF_POSITION                            0x0
#define _PWM2GIR_S1P1IF_SIZE                                0x1
#define _PWM2GIR_S1P1IF_LENGTH                              0x1
#define _PWM2GIR_S1P1IF_MASK                                0x1
#define _PWM2GIR_S1P2IF_POSN                                0x1
#define _PWM2GIR_S1P2IF_POSITION                            0x1
#define _PWM2GIR_S1P2IF_SIZE                                0x1
#define _PWM2GIR_S1P2IF_LENGTH                              0x1
#define _PWM2GIR_S1P2IF_MASK                                0x2

// Register: PWM2GIE
#define PWM2GIE PWM2GIE
extern volatile unsigned char           PWM2GIE             __at(0x594);
#ifndef _LIB_BUILD
asm("PWM2GIE equ 0594h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IE                 :1;
        unsigned S1P2IE                 :1;
    };
} PWM2GIEbits_t;
