MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13254/mcu.h
// Register: ADCG1B
#define ADCG1B ADCG1B
extern volatile unsigned char           ADCG1B              __at(0x1D2F);
#ifndef _LIB_BUILD
asm("ADCG1B equ 01D2Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGB0                   :1;
        unsigned CGB1                   :1;
        unsigned CGB2                   :1;
        unsigned CGB3                   :1;
        unsigned CGB4                   :1;
        unsigned CGB5                   :1;
        unsigned CGB6                   :1;
        unsigned CGB7                   :1;
    };
} ADCG1Bbits_t;
extern volatile ADCG1Bbits_t ADCG1Bbits __at(0x1D2F);
// bitfield macros
#define _ADCG1B_CGB0_POSN                                   0x0
#define _ADCG1B_CGB0_POSITION                               0x0
#define _ADCG1B_CGB0_SIZE                                   0x1
#define _ADCG1B_CGB0_LENGTH                                 0x1
#define _ADCG1B_CGB0_MASK                                   0x1
#define _ADCG1B_CGB1_POSN                                   0x1
#define _ADCG1B_CGB1_POSITION                               0x1
#define _ADCG1B_CGB1_SIZE                                   0x1
#define _ADCG1B_CGB1_LENGTH                                 0x1
#define _ADCG1B_CGB1_MASK                                   0x2
#define _ADCG1B_CGB2_POSN                                   0x2
#define _ADCG1B_CGB2_POSITION                               0x2
#define _ADCG1B_CGB2_SIZE                                   0x1
#define _ADCG1B_CGB2_LENGTH                                 0x1
#define _ADCG1B_CGB2_MASK                                   0x4
#define _ADCG1B_CGB3_POSN                                   0x3
#define _ADCG1B_CGB3_POSITION                               0x3
#define _ADCG1B_CGB3_SIZE                                   0x1
#define _ADCG1B_CGB3_LENGTH                                 0x1
#define _ADCG1B_CGB3_MASK                                   0x8
#define _ADCG1B_CGB4_POSN                                   0x4
#define _ADCG1B_CGB4_POSITION                               0x4
#define _ADCG1B_CGB4_SIZE                                   0x1
#define _ADCG1B_CGB4_LENGTH                                 0x1
#define _ADCG1B_CGB4_MASK                                   0x10
#define _ADCG1B_CGB5_POSN                                   0x5
#define _ADCG1B_CGB5_POSITION                               0x5
#define _ADCG1B_CGB5_SIZE                                   0x1
#define _ADCG1B_CGB5_LENGTH                                 0x1
#define _ADCG1B_CGB5_MASK                                   0x20
#define _ADCG1B_CGB6_POSN                                   0x6
#define _ADCG1B_CGB6_POSITION                               0x6
#define _ADCG1B_CGB6_SIZE                                   0x1
#define _ADCG1B_CGB6_LENGTH                                 0x1
#define _ADCG1B_CGB6_MASK                                   0x40
#define _ADCG1B_CGB7_POSN                                   0x7
#define _ADCG1B_CGB7_POSITION                               0x7
#define _ADCG1B_CGB7_SIZE                                   0x1
#define _ADCG1B_CGB7_LENGTH                                 0x1
#define _ADCG1B_CGB7_MASK                                   0x80

// Register: ADCG1C
#define ADCG1C ADCG1C
extern volatile unsigned char           ADCG1C              __at(0x1D30);
#ifndef _LIB_BUILD
asm("ADCG1C equ 01D30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CGC0                   :1;
        unsigned CGC1                   :1;
        unsigned CGC2                   :1;
        unsigned CGC3                   :1;
        unsigned CGC4                   :1;
        unsigned CGC5                   :1;
        unsigned CGC6                   :1;
        unsigned CGC7                   :1;
    };
} ADCG1Cbits_t;
extern volatile ADCG1Cbits_t ADCG1Cbits __at(0x1D30);
// bitfield macros
#define _ADCG1C_CGC0_POSN                                   0x0
#define _ADCG1C_CGC0_POSITION                               0x0
#define _ADCG1C_CGC0_SIZE                                   0x1
#define _ADCG1C_CGC0_LENGTH                                 0x1
#define _ADCG1C_CGC0_MASK                                   0x1
#define _ADCG1C_CGC1_POSN                                   0x1
#define _ADCG1C_CGC1_POSITION                               0x1
#define _ADCG1C_CGC1_SIZE                                   0x1
#define _ADCG1C_CGC1_LENGTH                                 0x1
#define _ADCG1C_CGC1_MASK                                   0x2
#define _ADCG1C_CGC2_POSN                                   0x2
#define _ADCG1C_CGC2_POSITION                               0x2
#define _ADCG1C_CGC2_SIZE                                   0x1
#define _ADCG1C_CGC2_LENGTH                                 0x1
#define _ADCG1C_CGC2_MASK                                   0x4
#define _ADCG1C_CGC3_POSN                                   0x3
#define _ADCG1C_CGC3_POSITION                               0x3
#define _ADCG1C_CGC3_SIZE                                   0x1
#define _ADCG1C_CGC3_LENGTH                                 0x1
#define _ADCG1C_CGC3_MASK                                   0x8
#define _ADCG1C_CGC4_POSN                                   0x4
#define _ADCG1C_CGC4_POSITION                               0x4
#define _ADCG1C_CGC4_SIZE                                   0x1
#define _ADCG1C_CGC4_LENGTH                                 0x1
#define _ADCG1C_CGC4_MASK                                   0x10
#define _ADCG1C_CGC5_POSN                                   0x5
#define _ADCG1C_CGC5_POSITION                               0x5
#define _ADCG1C_CGC5_SIZE                                   0x1
#define _ADCG1C_CGC5_LENGTH                                 0x1
#define _ADCG1C_CGC5_MASK                                   0x20
#define _ADCG1C_CGC6_POSN                                   0x6
#define _ADCG1C_CGC6_POSITION                               0x6
#define _ADCG1C_CGC6_SIZE                                   0x1
#define _ADCG1C_CGC6_LENGTH                                 0x1
#define _ADCG1C_CGC6_MASK                                   0x40
#define _ADCG1C_CGC7_POSN                                   0x7
#define _ADCG1C_CGC7_POSITION                               0x7
#define _ADCG1C_CGC7_SIZE                                   0x1
#define _ADCG1C_CGC7_LENGTH                                 0x1
#define _ADCG1C_CGC7_MASK                                   0x80

// Register: RA0PPS
#define RA0PPS RA0PPS
extern volatile unsigned char           RA0PPS              __at(0x1D8C);
#ifndef _LIB_BUILD
asm("RA0PPS equ 01D8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA0PPS                 :6;
    };
} RA0PPSbits_t;
extern volatile RA0PPSbits_t RA0PPSbits __at(0x1D8C);
// bitfield macros
#define _RA0PPS_RA0PPS_POSN                                 0x0
#define _RA0PPS_RA0PPS_POSITION                             0x0
#define _RA0PPS_RA0PPS_SIZE                                 0x6
#define _RA0PPS_RA0PPS_LENGTH                               0x6
#define _RA0PPS_RA0PPS_MASK                                 0x3F

// Register: RA1PPS
#define RA1PPS RA1PPS
extern volatile unsigned char           RA1PPS              __at(0x1D8D);
#ifndef _LIB_BUILD
asm("RA1PPS equ 01D8Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA1PPS                 :6;
    };
} RA1PPSbits_t;
extern volatile RA1PPSbits_t RA1PPSbits __at(0x1D8D);
// bitfield macros
#define _RA1PPS_RA1PPS_POSN                                 0x0
#define _RA1PPS_RA1PPS_POSITION                             0x0
#define _RA1PPS_RA1PPS_SIZE                                 0x6
#define _RA1PPS_RA1PPS_LENGTH                               0x6
#define _RA1PPS_RA1PPS_MASK                                 0x3F

// Register: RA2PPS
#define RA2PPS RA2PPS
extern volatile unsigned char           RA2PPS              __at(0x1D8E);
#ifndef _LIB_BUILD
asm("RA2PPS equ 01D8Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RA2PPS                 :6;
    };
} RA2PPSbits_t;
