MikroElektronika/core_packages/PIC/XC8/def/pic/PIC16F13254/mcu.h
extern volatile RC4PPSbits_t RC4PPSbits __at(0x1DA0);
// bitfield macros
#define _RC4PPS_RC4PPS_POSN                                 0x0
#define _RC4PPS_RC4PPS_POSITION                             0x0
#define _RC4PPS_RC4PPS_SIZE                                 0x6
#define _RC4PPS_RC4PPS_LENGTH                               0x6
#define _RC4PPS_RC4PPS_MASK                                 0x3F

// Register: RC5PPS
#define RC5PPS RC5PPS
extern volatile unsigned char           RC5PPS              __at(0x1DA1);
#ifndef _LIB_BUILD
asm("RC5PPS equ 01DA1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC5PPS                 :6;
    };
} RC5PPSbits_t;
extern volatile RC5PPSbits_t RC5PPSbits __at(0x1DA1);
// bitfield macros
#define _RC5PPS_RC5PPS_POSN                                 0x0
#define _RC5PPS_RC5PPS_POSITION                             0x0
#define _RC5PPS_RC5PPS_SIZE                                 0x6
#define _RC5PPS_RC5PPS_LENGTH                               0x6
#define _RC5PPS_RC5PPS_MASK                                 0x3F

// Register: RC6PPS
#define RC6PPS RC6PPS
extern volatile unsigned char           RC6PPS              __at(0x1DA2);
#ifndef _LIB_BUILD
asm("RC6PPS equ 01DA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC6PPS                 :6;
    };
} RC6PPSbits_t;
extern volatile RC6PPSbits_t RC6PPSbits __at(0x1DA2);
// bitfield macros
#define _RC6PPS_RC6PPS_POSN                                 0x0
#define _RC6PPS_RC6PPS_POSITION                             0x0
#define _RC6PPS_RC6PPS_SIZE                                 0x6
#define _RC6PPS_RC6PPS_LENGTH                               0x6
#define _RC6PPS_RC6PPS_MASK                                 0x3F

// Register: RC7PPS
#define RC7PPS RC7PPS
extern volatile unsigned char           RC7PPS              __at(0x1DA3);
#ifndef _LIB_BUILD
asm("RC7PPS equ 01DA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RC7PPS                 :6;
    };
} RC7PPSbits_t;
extern volatile RC7PPSbits_t RC7PPSbits __at(0x1DA3);
// bitfield macros
#define _RC7PPS_RC7PPS_POSN                                 0x0
#define _RC7PPS_RC7PPS_POSITION                             0x0
#define _RC7PPS_RC7PPS_SIZE                                 0x6
#define _RC7PPS_RC7PPS_LENGTH                               0x6
#define _RC7PPS_RC7PPS_MASK                                 0x3F

// Register: TRISC0PPS
#define TRISC0PPS TRISC0PPS
extern volatile unsigned char           TRISC0PPS           __at(0x1DD0);
#ifndef _LIB_BUILD
asm("TRISC0PPS equ 01DD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC0PPS              :6;
    };
} TRISC0PPSbits_t;
extern volatile TRISC0PPSbits_t TRISC0PPSbits __at(0x1DD0);
// bitfield macros
#define _TRISC0PPS_TRISC0PPS_POSN                           0x0
#define _TRISC0PPS_TRISC0PPS_POSITION                       0x0
#define _TRISC0PPS_TRISC0PPS_SIZE                           0x6
#define _TRISC0PPS_TRISC0PPS_LENGTH                         0x6
#define _TRISC0PPS_TRISC0PPS_MASK                           0x3F

// Register: TRISC1PPS
#define TRISC1PPS TRISC1PPS
extern volatile unsigned char           TRISC1PPS           __at(0x1DD1);
#ifndef _LIB_BUILD
asm("TRISC1PPS equ 01DD1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC1PPS              :6;
    };
} TRISC1PPSbits_t;
extern volatile TRISC1PPSbits_t TRISC1PPSbits __at(0x1DD1);
// bitfield macros
#define _TRISC1PPS_TRISC1PPS_POSN                           0x0
#define _TRISC1PPS_TRISC1PPS_POSITION                       0x0
#define _TRISC1PPS_TRISC1PPS_SIZE                           0x6
#define _TRISC1PPS_TRISC1PPS_LENGTH                         0x6
#define _TRISC1PPS_TRISC1PPS_MASK                           0x3F

// Register: TRISC2PPS
#define TRISC2PPS TRISC2PPS
extern volatile unsigned char           TRISC2PPS           __at(0x1DD2);
#ifndef _LIB_BUILD
asm("TRISC2PPS equ 01DD2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC2PPS              :6;
    };
} TRISC2PPSbits_t;
extern volatile TRISC2PPSbits_t TRISC2PPSbits __at(0x1DD2);
// bitfield macros
#define _TRISC2PPS_TRISC2PPS_POSN                           0x0
#define _TRISC2PPS_TRISC2PPS_POSITION                       0x0
#define _TRISC2PPS_TRISC2PPS_SIZE                           0x6
#define _TRISC2PPS_TRISC2PPS_LENGTH                         0x6
#define _TRISC2PPS_TRISC2PPS_MASK                           0x3F

// Register: TRISC3PPS
#define TRISC3PPS TRISC3PPS
extern volatile unsigned char           TRISC3PPS           __at(0x1DD3);
#ifndef _LIB_BUILD
asm("TRISC3PPS equ 01DD3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC3PPS              :6;
    };
} TRISC3PPSbits_t;
extern volatile TRISC3PPSbits_t TRISC3PPSbits __at(0x1DD3);
// bitfield macros
#define _TRISC3PPS_TRISC3PPS_POSN                           0x0
#define _TRISC3PPS_TRISC3PPS_POSITION                       0x0
#define _TRISC3PPS_TRISC3PPS_SIZE                           0x6
#define _TRISC3PPS_TRISC3PPS_LENGTH                         0x6
#define _TRISC3PPS_TRISC3PPS_MASK                           0x3F

// Register: TRISC4PPS
#define TRISC4PPS TRISC4PPS
extern volatile unsigned char           TRISC4PPS           __at(0x1DD4);
#ifndef _LIB_BUILD
asm("TRISC4PPS equ 01DD4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC4PPS              :6;
    };
} TRISC4PPSbits_t;
extern volatile TRISC4PPSbits_t TRISC4PPSbits __at(0x1DD4);
// bitfield macros
#define _TRISC4PPS_TRISC4PPS_POSN                           0x0
#define _TRISC4PPS_TRISC4PPS_POSITION                       0x0
#define _TRISC4PPS_TRISC4PPS_SIZE                           0x6
#define _TRISC4PPS_TRISC4PPS_LENGTH                         0x6
#define _TRISC4PPS_TRISC4PPS_MASK                           0x3F

// Register: TRISC5PPS
#define TRISC5PPS TRISC5PPS
extern volatile unsigned char           TRISC5PPS           __at(0x1DD5);
#ifndef _LIB_BUILD
asm("TRISC5PPS equ 01DD5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC5PPS              :6;
    };
} TRISC5PPSbits_t;
extern volatile TRISC5PPSbits_t TRISC5PPSbits __at(0x1DD5);
// bitfield macros
#define _TRISC5PPS_TRISC5PPS_POSN                           0x0
#define _TRISC5PPS_TRISC5PPS_POSITION                       0x0
#define _TRISC5PPS_TRISC5PPS_SIZE                           0x6
#define _TRISC5PPS_TRISC5PPS_LENGTH                         0x6
#define _TRISC5PPS_TRISC5PPS_MASK                           0x3F

// Register: TRISC6PPS
#define TRISC6PPS TRISC6PPS
extern volatile unsigned char           TRISC6PPS           __at(0x1DD6);
#ifndef _LIB_BUILD
asm("TRISC6PPS equ 01DD6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISC6PPS              :6;
    };
} TRISC6PPSbits_t;
